Courses/7140/Lectures/SecureProg/javaSecurity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Secure Java Programming</title>
<!-- 2016-04-05 Tue 11:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CS7140 Software Engineering Lecture"
 />
</head>
<body>
<div id="content">
<h1 class="title">Secure Java Programming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Java vulnerabilties</a></li>
<li><a href="#sec-2">2. The Security Manager</a></li>
<li><a href="#sec-3">3. Java Classloader</a></li>
<li><a href="#sec-4">4. Java Sandbox</a></li>
<li><a href="#sec-5">5. </a></li>
<li><a href="#sec-6">6. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Java vulnerabilties</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>jdk*11 to jdk*17
</li>
<li><a href="https://www.google.com/search?q=java+vulnerabilities+2013">https://www.google.com/search?q=java+vulnerabilities+2013</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The Security Manager</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>A security manager is an object.
</li>
<li>Defines a security policy for an application. 
</li>
<li>system policy file <code>${JAVA_HOME}/lib/security/java.policy</code>
<ol class="org-ol">
<li>e.g ., <code>/usr/lib/jvm/jdk1.7.0_13/jre/lib/security/java.policy</code>
</li>
<li><a href="http://docs.oracle.com/javase/tutorial/security/userperm/policy.html">http://docs.oracle.com/javase/tutorial/security/userperm/policy.html</a>
</li>
</ol>
</li>
<li>Java library checks with SM whenever a "dangerous" operation is
about to be called.
</li>
<li>SM can raise a <code>SecurityException</code>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Java Classloader</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Part of the JRE that dynamically loads classes into the JVM.
</li>

<li>The bootstrap class loader loads the core libraries
<code>{$JAVA_HOME/jre/lib}</code>
</li>

<li>The extensions class loader loads the code in the extensions
directories <code>{$JAVA_HOME/jre/lib/ext}</code>
</li>

<li>The system class loader loads code found on <code>$CLASSPATH.</code>
</li>

<li>Classes loaded by different loaders do not have package-private
access to one another even if they have the same package name.
</li>

<li><a href="http://en.wikipedia.org/wiki/Java_Classloader">http://en.wikipedia.org/wiki/Java_Classloader</a>  Reference
</li>

<li><a href="http://www.onjava.com/pub/a/onjava/2005/01/26/classloading.html">http://www.onjava.com/pub/a/onjava/2005/01/26/classloading.html</a> Reference
</li>

<li><a href="http://incubator.apache.org/depot/version/jar-hell.html">http://incubator.apache.org/depot/version/jar-hell.html</a> Reference
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Java Sandbox</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>The sandbox is a set of rules.  Similar to "jail", <code>chroot</code>.
</li>

<li>Byte Code Verifier &#x2013; Checks ("verifies") JVM code before allowing to run. 
</li>

<li>Applet Class Loader &#x2013; when and how an applet can add/replace
classes to JRE.  Applets are sent by a web server.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="./sec-java-oracle-pm-edited.html">./sec-java-oracle-pm-edited.html</a></h2>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li><a href="http://docs.oracle.com/javase/tutorial/index.html">http://docs.oracle.com/javase/tutorial/index.html</a> Java Tutorials by
sun/oracle.com.  Excellent tutorials.  Free to download in its
1000+ page entirety. Recommended Reading.
</li>

<li><a href="http://docs.oracle.com/javase/tutorial/security/index.html">http://docs.oracle.com/javase/tutorial/security/index.html</a>
"Tutorial Trail: Security Features in Java SE"  From the above.
Highly Recommended Reading
</li>

<li><a href="http://www.oracle.com/technetwork/java/seccodeguide-139067.html">http://www.oracle.com/technetwork/java/seccodeguide-139067.html</a>
Secure Coding Guidelines for Java.  Today's lecture is based on
this.  <a href="./sec-java-oracle-pm-edited.html">CS7140 version</a> Required Reading.
</li>

<li><a href="http://docs.oracle.com/javase/7/docs/technotes/guides/security/index.html">http://docs.oracle.com/javase/7/docs/technotes/guides/security/index.html</a>
Java security APIs: cryptography, public key infrastructure, secure
communication (TLS, SASL), authentication (JAAS), and access
control.  Reference
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Prabhaker Mateti (<a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
